app/controllers/books_controller.rb

SELECT "books".* FROM "books" LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "books"
---
	def index
		@books = Book.page(params[:page])

INSERT INTO "books" ("title", "writer", "pages", "book_binding", "copies", "created_at", "updated_at", "created_by", "update_by") VALUES ('Teste2ac', 'TEste23', NULL, NULL, NULL, '2015-11-09 12:59:58.588963', '2015-11-09 12:59:58.588963', NULL, NULL)
---
	def create
		@book = Book.new(params[:book])

		flash[:notice] = t_successfully_created_local if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = 9 LIMIT 1
UPDATE "books" SET "title" = 'asd', "writer" = 'asd', "pages" = 123, "copies" = 123, "book_binding" = 0, "updated_at" = '2015-11-10 13:22:09.282665' WHERE "books"."id" = 19
---
	def update
		@book = Book.find(params[:id])
		flash[:notice] = t_successfully_updated_local if @book.update_attributes(params[:book])