app/controllers/loans_controller.rb

	def index
		@loans = Loan.page(params[:page])
---
SELECT "loans".* FROM "loans" LIMIT 25 OFFSET 0

	def show
		@loan = Loan.find(params[:id])
---
SELECT "loans".* FROM "loans" WHERE "loans"."id" = 2 LIMIT 1

	def edit
		@loan = Loan.find(params[:id])
---
SELECT "loans".* FROM "loans" WHERE "loans"."id" = 2 LIMIT 1

	def create
		@loan = Loan.new(params[:loan])

		flash[:notice] = 'Loan was successfully created.' if @loan.save
---
INSERT INTO "loans" ("book_id", "user_id", "starts_at", "end_at", "created_by", "update_by", "created_at", "updated_at") VALUES (NULL, NULL, NULL, NULL, 8, 8, '2015-11-10 16:17:57.529087', '2015-11-10 16:17:57.529087')

	def update
		@loan = Loan.find(params[:id])
		flash[:notice] = 'Loan was successfully updated.' if @loan.update_attributes(params[:Loan])
---
SELECT "loans".* FROM "loans" WHERE "loans"."id" = 2 LIMIT 1
UPDATE "loans" SET "end_at" = '2015-11-10', "update_by" = 8, "updated_at" = '2015-11-10 15:51:29.995922' WHERE "loans"."id" = 2

	def destroy
		@loan = Loan.find(params[:id])
		@loan.destroy
---
SELECT "loans".* FROM "loans" WHERE "loans"."id" = 20 LIMIT 1
DELETE FROM "loans" WHERE "loans"."id" = 20

	def load_resources
		@users = User.all
		@books = Book.all
---
SELECT "users".* FROM "users"
SELECT "books".* FROM "books"