app/controllers/users_controller.rb

INSERT INTO "users" ("name", "login", "password", "email", "is_employee", "created_at", "updated_at", "created_by", "update_by") VALUES ('gabriel', 'gt_katakura', '123456', 'gt.katakura@gmail.com', 't', '2015-11-09 11:35:33.979664', '2015-11-09 11:35:33.979664', NULL, NULL)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save